Revit 2026 API

# SymbolicCurveSetVisibility Method

---

Sets the visibility for the symbolic curve.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void SetVisibility(
	FamilyElementVisibility visibility
)
```
```vb
Public Sub SetVisibility (
	visibility As FamilyElementVisibility
)
```
```cpp
public:
void SetVisibility(
	FamilyElementVisibility^ visibility
)
```
```fsharp
member SetVisibility :
        visibility : FamilyElementVisibility -> unit
```

#### Parameters

visibility FamilyElementVisibility

| Exception | Condition |
| --- | --- |
| ArgumentNullException | Thrown when visibility is . |
| ArgumentException | Thrown when visibility is not valid for symbolic curves. |
| InvalidOperationException | Thrown when regeneration failed. |

The visibility of the symbolic curve geometry can be changed for different detail levels.

#### Reference

SymbolicCurve Class

Autodesk.Revit.DB Namespace